Test/Node.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8003

Document Path:          /prime
Document Length:        4 bytes

Concurrency Level:      100
Time taken for tests:   30.144 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      20200000 bytes
Total body sent:        15500000
HTML transferred:       400000 bytes
Requests per second:    3317.41 [#/sec] (mean)
Time per request:       30.144 [ms] (mean)
Time per request:       0.301 [ms] (mean, across all concurrent requests)
Transfer rate:          654.41 [Kbytes/sec] received
                        502.15 kb/s sent
                        1156.56 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.2      1       3
Processing:     1   30   1.3     29      46
Waiting:        1   24   2.7     24      38
Total:          4   30   1.3     30      46

Percentage of the requests served within a certain time (ms)
  50%     30
  66%     30
  75%     30
  80%     31
  90%     31
  95%     32
  98%     34
  99%     36
 100%     46 (longest request)