Test/go.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8001

Document Path:          /prime
Document Length:        4 bytes

Concurrency Level:      100
Time taken for tests:   5.850 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      12000000 bytes
Total body sent:        15500000
HTML transferred:       400000 bytes
Requests per second:    17092.95 [#/sec] (mean)
Time per request:       5.850 [ms] (mean)
Time per request:       0.059 [ms] (mean, across all concurrent requests)
Transfer rate:          2003.08 [Kbytes/sec] received
                        2587.31 kb/s sent
                        4590.39 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   0.4      2       9
Processing:     1    3   2.4      3      82
Waiting:        1    3   2.3      2      75
Total:          3    6   2.4      6      84

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      6
  90%      6
  95%      6
  98%      7
  99%      7
 100%     84 (longest request)